import { Container } from '../../components/Container/Container';
import { Button } from '../../ui/Button/Button';
import { Highlighter } from '../../ui/Highlighter/Highlighter';
import s from './Advantages.module.scss';

export const Advantages = () => {
  return (
    <section className={s.advantages}>
      <Container className={s.advantagesContainer}>
        <div className={s.about}>
          <h2 className={s.brief}>Партнерская программа</h2>

          <h1 className={s.title}>
            Зарабатывайте <br />
            <Highlighter>до $10 000</Highlighter>
            <br /> вместе с BILLZ
          </h1>

          <p className={s.descr}>
            Начни свой бизнес в IT-сфере продавая <br />
            одну из лучших программ для
            <br />
            автоматизации магазинов <br />в Центральной Азии
          </p>
        </div>

        <ul className={s.list}>
          <li className={s.item}>
            <img
              src='/images/advantages/1.png'
              alt='Вложения от $500 до $10 000'
              className={s.image}
            />
            <div className={s.pros}>
              <svg
                width='27'
                height='19'
                viewBox='0 0 27 19'
                fill='none'
                xmlns='http://www.w3.org/2000/svg'
              >
                <path
                  d='M24 0.5C25.6406 0.5 27 1.85938 27 3.5V15.5C27 17.1875 25.6406 18.5 24 18.5H3C1.3125 18.5 0 17.1875 0 15.5V3.5C0 1.85938 1.3125 0.5 3 0.5H24ZM6 15.5C6 13.8594 4.64062 12.5 3 12.5V15.5H6ZM3 6.5C4.64062 6.5 6 5.1875 6 3.5H3V6.5ZM24 15.5V12.5C22.3125 12.5 21 13.8594 21 15.5H24ZM24 3.5H21C21 5.1875 22.3125 6.5 24 6.5V3.5ZM13.5 14C15.9844 14 18 11.9844 18 9.5C18 7.01562 15.9844 5 13.5 5C10.9688 5 9 7.01562 9 9.5C9 11.9844 10.9688 14 13.5 14Z'
                  fill='#0065FF'
                />
              </svg>
              <p>
                Вложения от <Highlighter>$500</Highlighter>&nbsp;до&nbsp;
                <Highlighter>$10 000</Highlighter>
              </p>
            </div>
          </li>
          <li className={s.item}>
            <img
              src='/images/advantages/2.png'
              alt='Заработок от $1 000 до $10 000'
              className={s.image}
            />
            <div className={s.pros}>
              <svg
                width='24'
                height='25'
                viewBox='0 0 24 25'
                fill='none'
                xmlns='http://www.w3.org/2000/svg'
              >
                <path
                  d='M15 5H9L6.75 1.67188C6.42188 1.20312 6.79688 0.5 7.35938 0.5H16.5938C17.1562 0.5 17.5312 1.20312 17.2031 1.67188L15 5ZM9 6.5H15C15.1406 6.64062 15.375 6.78125 15.5625 6.92188C18.2344 8.60938 24 12.2656 24 20C24 22.4844 21.9844 24.5 19.5 24.5H4.5C1.96875 24.5 0 22.4844 0 20C0 12.2656 5.71875 8.60938 8.39062 6.92188C8.57812 6.78125 8.8125 6.64062 9 6.5ZM12.9375 11C12.9375 10.4844 12.5156 10.0625 11.9531 10.0625C11.4375 10.0625 11.0156 10.4844 11.0156 11V11.2812C10.7812 11.375 10.5 11.4219 10.3125 11.5625C9.60938 11.8438 9 12.4531 8.8125 13.2969C8.76562 13.7656 8.8125 14.2344 9 14.6562C9.1875 15.0781 9.51562 15.3594 9.79688 15.5938C10.3594 15.9688 11.0625 16.1562 11.625 16.3438H11.7188C12.375 16.5781 12.7969 16.7188 13.0781 16.9062C13.2188 17 13.2656 17.0469 13.2656 17.0938C13.2656 17.1406 13.3125 17.2344 13.2656 17.4219C13.2656 17.5625 13.1719 17.7031 12.8906 17.8438C12.6094 17.9375 12.1406 17.9844 11.5312 17.8906C11.25 17.8438 10.7812 17.7031 10.3125 17.5625C10.2188 17.5156 10.125 17.4688 10.0312 17.4219C9.51562 17.2812 9 17.5625 8.85938 18.0312C8.67188 18.5469 8.95312 19.0625 9.42188 19.2031C9.46875 19.25 9.5625 19.25 9.65625 19.2969C9.98438 19.4375 10.5938 19.625 11.0156 19.7188V20C11.0156 20.5625 11.4375 20.9844 11.9531 20.9844C12.5156 20.9844 12.9375 20.5625 12.9375 20V19.7656C13.1719 19.7188 13.4062 19.625 13.6406 19.5312C14.3906 19.25 14.9531 18.6406 15.1406 17.75C15.1875 17.2344 15.1875 16.7656 15 16.3438C14.8125 15.9219 14.4844 15.6406 14.2031 15.4062C13.6406 14.9844 12.8438 14.75 12.2812 14.5625H12.2344C11.5781 14.375 11.1562 14.2344 10.875 14.0469C10.7344 13.9531 10.6875 13.9062 10.6875 13.8594C10.6875 13.8594 10.6406 13.8125 10.6875 13.625C10.6875 13.5312 10.7812 13.3906 11.0625 13.25C11.3438 13.1094 11.8125 13.0625 12.4219 13.1094C12.6094 13.1562 13.2656 13.2969 13.4062 13.3438C13.9219 13.4844 14.4375 13.1562 14.5781 12.6875C14.7188 12.1719 14.3906 11.6562 13.9219 11.5156C13.6875 11.4688 13.2188 11.375 12.9375 11.3281V11Z'
                  fill='#0065FF'
                />
              </svg>
              <p>
                Заработок от <Highlighter>$1 000</Highlighter>
                &nbsp;до&nbsp;
                <Highlighter>$10 000</Highlighter>
              </p>
            </div>
          </li>
          <li className={s.item}>
            <img
              src='/images/advantages/3.png'
              alt='Окупаемость со 2-го месяца'
              className={s.image}
            />
            <div className={s.pros}>
              <svg
                width='28'
                height='16'
                viewBox='0 0 28 16'
                fill='none'
                xmlns='http://www.w3.org/2000/svg'
              >
                <path
                  d='M19 3C18.1562 3 17.5 2.34375 17.5 1.5C17.5 0.703125 18.1562 0 19 0H26.5C27.2969 0 28 0.703125 28 1.5V9C28 9.84375 27.2969 10.5 26.5 10.5C25.6562 10.5 25 9.84375 25 9V5.15625L17.0312 13.0781C16.4688 13.6875 15.4844 13.6875 14.9219 13.0781L9.95312 8.15625L3.53125 14.5781C2.96875 15.1875 1.98438 15.1875 1.42188 14.5781C0.8125 14.0156 0.8125 13.0312 1.42188 12.4688L8.92188 4.96875C9.48438 4.35938 10.4688 4.35938 11.0312 4.96875L16 9.89062L22.8438 3H19Z'
                  fill='#0065FF'
                />
              </svg>
              <p>
                Окупаемость со <Highlighter>2-го месяца</Highlighter>
              </p>
            </div>
          </li>
          <li className={s.item}>
            <img
              src='/images/advantages/4.png'
              alt='Обучение всем процессам'
              className={s.image}
            />
            <div className={s.pros}>
              <svg
                width='24'
                height='25'
                viewBox='0 0 24 25'
                fill='none'
                xmlns='http://www.w3.org/2000/svg'
              >
                <path
                  d='M8.95312 11L9 16.25C9 17.0938 8.29688 17.75 7.5 17.75H6.75C5.0625 17.75 3.75 16.4375 3.75 14.75V12.5469C3.75 10.8594 5.0625 9.5 6.75 9.5H7.45312C8.25 9.5 8.95312 10.2031 8.95312 11ZM12 0.5C18.7031 0.5 23.7656 6.125 24 12.5V19.25C24 21.5469 22.125 23.375 19.875 23.375H14.6719C14.2969 24.0781 13.5469 24.5 12.75 24.5H11.2031C9.84375 24.5 8.76562 23.2812 9 21.8281C9.23438 20.75 10.2188 20 11.2969 20H12.75C13.5469 20 14.2969 20.4688 14.6719 21.125H19.875C20.9062 21.125 21.75 20.3281 21.75 19.25V12.5C21.75 7.15625 17.3438 2.79688 12 2.79688C6.60938 2.79688 2.25 7.15625 2.25 12.5V14.375C2.25 15.0312 1.64062 15.5 1.07812 15.5C0.46875 15.5 0 15.0312 0 14.375V12.5C0.1875 6.125 5.25 0.5 12 0.5ZM17.25 17.75H16.5C15.6562 17.75 15 17.0938 15 16.25V11.0469C15 10.2031 15.6562 9.5 16.5 9.5H17.25C18.8906 9.5 20.25 10.8594 20.25 12.5469V14.75C20.25 16.4375 18.8906 17.75 17.25 17.75Z'
                  fill='#0065FF'
                />
              </svg>
              <p>
                <Highlighter>Обучение</Highlighter> всем процессам
              </p>
            </div>
          </li>
        </ul>

        <Button className={s.button} tag='Link' to='/'>
          Оставить заявку на консультацию
        </Button>
      </Container>

      <figure className={s.picturesMobile}>
        <img src='/images/advantages/1.png' alt='Вложения от $500 до $10 000' />
        <img
          src='/images/advantages/2.png'
          alt='Заработок от $1 000 до $10 000'
        />
        <img src='/images/advantages/3.png' alt='Окупаемость со 2-го месяца' />
        <img src='/images/advantages/4.png' alt='Обучение всем процессам' />
      </figure>
    </section>
  );
};
